[XComGame.UIArmory_Loadout]
[UIArmory_Loadout]
m_strInventoryLabels[eInvSlot_AugmentationHead]=MELEE
m_strInventoryLabels[eInvSlot_AugmentationTorso]=SIDEARM
m_strInventoryLabels[eInvSlot_AugmentationArms]=GREMLIN
m_strInventoryLabels[eInvSlot_AugmentationLegs]=GRENADE LAUNCHER

[STCO_Soldier X2SoldierClassTemplate]
+DisplayName="Soldier"
+ClassSummary="The Ranger serves as our primary reconnaissance unit, capable of moving independently in concealment while engaging enemies at close range."

[STCO_SpecialTrainingStaffSlot X2StaffSlotTemplate]
EmptyText="OPEN: SOLDIER REQUIRED"
BonusEmptyText="Trains soldiers in new specializations."
BonusDefaultText="SPECIALIZATION"
BonusText="%SKILL TRAINING"
FilledText="%UNITNAME is now enrolled in an extensive %SKILL training program!"
LockedText="LOCKED: PURCHASE UPGRADE"